
/**
 * Нужны-ли связи и индексы для слияния строк через хеш таблицу.
 * 
 */
  
/***** Проверка списка ограничений *******************************************************************/
SELECT * FROM pg_catalog.pg_constraint ORDER BY conname; 								 /*****/
/*****************************************************************************************************/	
	
/****** Проверка списка индексов *********************************************************************/
SELECT * FROM pg_catalog.pg_indexes WHERE schemaname = 'bookings' ORDER BY tablename, indexname;/*****/
/*****************************************************************************************************/	

/****** Удаляем ограничение внешнего ключа *****/
ALTER TABLE tickets
DROP CONSTRAINT tickets_book_ref_fkey;
/***********************************************/

/****** Запуск планировщика ******/
EXPLAIN ANALYZE 
SELECT * 
FROM bookings boo INNER JOIN tickets ti ON boo.book_ref = ti.book_ref;
/*************************************************************************/

/****** Вернём ограничение на место **********************************************************/
ALTER TABLE tickets 
ADD CONSTRAINT tickets_book_ref_fkey FOREIGN KEY (book_ref) REFERENCES bookings (book_ref);
/*********************************************************************************************/	

/****** Добавим хеш индекс *****************/
CREATE INDEX bookings_book_ref_idx_hash
ON bookings USING hash (book_ref); 
/**********************************************/

/****** Удалим хеш индекс **********************/
DROP INDEX bookings_book_ref_idx_hash;
/**********************************************/

/****** Создадим хеш индекс ******************/
CREATE INDEX tickets_book_ref_idx_hash
ON tickets USING hash (book_ref); 
/**********************************************/

/****** Удалим хеш индекс **********************/
DROP INDEX tickets_book_ref_idx_hash;
/**********************************************/









